# Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо только числами.
# Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта,
# введя, например, команду «stop». При этом скрипт завершается, сформированный список с числами выводится на экран.
# Подсказка: для этого задания примем, что пользователь может вводить только числа и строки.
# Во время ввода пользователем очередного элемента необходимо реализовать проверку типа элемента.
# Вносить его в список, только если введено число.
# Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
# При этом работа скрипта не должна завершаться.

list = []
class Only_num(Exception):
    def __init__(self, alarm):
        self.alarm = alarm

while True:
    try:
        number = input("Введи число:  ")
        if number == "stop":
            print(list)
            break
        for i in number:
            if ord(i) > 57 or ord(i) < 48:
                raise Only_num("Введено не число")
        list.append(number)
    except Only_num as err:
        print(err)
        continue



